[
    {
        "vid": "17:10:1",
        "tokens": "Потом `наложил₋7760` `царь₋4428` `Артаксеркс₋325` `подать₋4522` на `землю₋776` и на `острова₋339` `морские₋3220`."
    },
    {
        "vid": "17:10:2",
        "tokens": "Впрочем, все `дела₋4639` `силы₋8633` его и `могущества₋1369` его и `обстоятельное₋6575` `показание₋6575` о `величии₋1420` `Мардохея₋4782`, которым `возвеличил₋1431` его `царь₋4428`, `записаны₋3789` в `книге₋5612` `дневных₋3117` `записей₋1697` `царей₋4428` `Мидийских₋4074` и `Персидских₋6539`,"
    },
    {
        "vid": "17:10:3",
        "tokens": "[равно как и то], что `Мардохей₋4782` `Иудеянин₋3064` [был] `вторым₋4932` по `царе₋4428` `Артаксерксе₋325` и `великим₋1419` у `Иудеев₋3064` и `любимым₋7521` у `множества₋7230` `братьев₋251` своих, [ибо] `искал₋1875` `добра₋2896` `народу₋5971` своему и `говорил₋1696` во `благо₋7965` всего `племени₋2233` своего. | [И сказал Мардохей: от Бога было это, ибо я вспомнил сон, который я видел о сих событиях; не осталось в нем ничего неисполнившимся. Малый источник сделался рекою, и был свет и солнце и множество воды: эта река есть Есфирь, которую взял себе в жену царь и сделал царицею. А два змея — это я и Аман; народы — это собравшиеся истребить имя Иудеев; а народ мой — это Израильтяне, воззвавшие к Богу и спасенные. И спас Господь народ Свой, и избавил нас Господь от всех сих зол, и совершил Бог знамения и чудеса великие, какие не бывали между язычниками. Так устроил Бог два жребия: один для народа Божия, а другой для всех язычников, и вышли эти два жребия в час и время и в день суда пред Богом и всеми язычниками. И вспомнил Господь о народе Своем и оправдал наследие Свое. И будут праздноваться эти дни месяца Адара, в четырнадцатый и пятнадцатый день этого месяца, с торжеством и радостью и весельем пред Богом, в роды вечные, в народе Его Израиле. В четвертый год царствования Птоломея и Клеопатры Досифей, который, говорят, был священником и левитом, и Птоломей, сын его, принесли [в] [Александрию] это послание о Пуриме, которое, говорят, истолковал Лисимах, [сын] Птоломея, бывший в Иерусалиме.]"
    }
]