<script setup lang="ts">
</script>

<template>
  <div>
    <h3>Варианты использования данного приложения</h3>
    <h4>
      Контекстный поиск по слову
    </h4>
    <p>
      В стихе находите заинтересовавшее слово (лексема на оригинальном языке - древнееврейский или древнегреческий), 
      при клике информация по нему откроется справа (или ниже).      
    </p>
    <p>
      При нажатии кнопки "Показать вхождения" будет показан список стихов, 
      в которых данная лексема встречается. Исходя из представленного контекста 
      можно более точно определить значение данной лексемы и смысл первоначального стиха.
    </p>
  </div>
</template>

<style scoped></style>
