<script setup lang="ts">
</script>

<template>
  <div>
    <h3>Пример использования приложения</h3>
    <!-- <h4>
      Обрезание
    </h4> -->
    <p>
      Исследуем вопрос, почему крайняя часть мужского полового органа имеет такое важное значение
      для близости человека к Богу.
    </p>
    <p>
      Переходим в <RouterLink to="/search"><i>Поиск</i></RouterLink> и ищем по словам "обрезание", "обрезать" и "обрезывать.
    </p>
    <p>
      H5243 H2168
      G4059 G4061
      H4135 H4139
      G0203

      крайняя плоть H6190 + H1320
      Сразу бросается в глаза, что слова "обрезать"
      <a href="http://localhost:5173/#/verse/23:5:6/H2168">(H2168)</a> и "обрезывать"
      <a href="http://localhost:5173/#/verse/23:5:6/H2168">()</a>  - совершенно разные.
    </p>
    <p>
      Также ищем по "обрезать" и "обрезывать"
    </p>
    <p>
      Смотрите, какие слова из словаря Стронга в исходном тексте были переведены вашими терминами.
    </p>
    <p>
      Анализируете их значение и контекст использования.
      
    </p>
  </div>
</template>

<style scoped></style>
