<script setup lang="ts">
</script>

<template>
  <div>
    <h3>Варианты использования данного приложения</h3>
    <h4>
      Определении семантика слова по контексту
    </h4>
    <p>
      В стихе находите заинтересовавшее слово с номером Стронга
      (на оригинальном языке - древнееврейском или древнегреческом),
      при клике информация по нему откроется справа (или ниже).
    </p>
    <p>
      При нажатии кнопки <i>"Показать вхождения"</i> будет показан список стихов,
      в которых данное слово встречается. Исходя из представленного контекста
      можно более точно определить значение данного слова и смысл первоначального стиха.
    </p>
    <h4>
      Поиск слова или фразы
    </h4>
    <p>
      Используя русскоязычный морфологический поиск находите стихи с вхождением нужных слов.
    </p>
    <p>
      Смотрите, какие слова из словаря Стронга в исходном тексте были переведены вашими терминами.
    </p>
    <p>
      Анализируете их значение и контекст использования.
    </p>
  </div>
</template>

<style scoped></style>
