<script setup lang="ts">
</script>

<template>
  <div>
    <h3>Функционал приложения</h3>

    <ul>
      <li>
        <h4>
          Текст Библии
        </h4>
        <p>
          Для выбора конкретной книги, главы и стиха нажмите на название текущей книги слева от навигационных кнопок.
        </p>
      </li>
      <li>
        <h4>
          Масоретский текст и Textus Receptus
        </h4>
        <p>
          Показ стихов масоретского текста и Textus Receptus (Новый Завет) с номерами Стронга и написанием в оригинале - на древнееврейском и древнегреческом языках
        </p>
      </li>
      <li>
        <h4>
          Перекрестные ссылки
        </h4>
        <p>
          Ссылки на другие стихи Библии, в которых упоминаются те же слова, имена, названия или события, 
          а также ссылки на слова или отрывки с тем же или близким по содержанию текстом.
        </p>
      </li>
      <li>
        <h4>
          Леммы Стронга
        </h4>
        <p>
          Словарь Стронга со статистикой и ссылками на список вхождений и переводами из словарей
          "Brown–Driver–Briggs a Hebrew and English Lexicon" и "Hebrew and Chaldee Gesenius Lexicon".
        </p>
      </li>
      <li>
        <h4>
          Всплывающие подсказки
        </h4>
        <p>
          С частичной информацией по лемме из словаря Стронга.
        </p>
      </li>      
      <li>
        <h4>
          Настройки
        </h4>
        <p>
          Позволяют менять параметры интерфейса веб-приложения.
        </p>
      </li>
      <li>
        <h4>
          Поиск
        </h4>
        <p>
          Морфологический поиск по русскоязычному переводу. 
          Выдача будет включать не только сам запрос, но и всевозможные словоформы из него.
          Искать можно по слову и по фразе (включение всех слов фразы).
        </p>
      </li>

    </ul>
  </div>
</template>

<style scoped></style>
