<script setup lang="ts">
</script>

<template>
  <div>
    <h3>Пример использования приложения</h3>
    <!-- <h4>
 Обрезание
 </h4> -->
    <p>
      Исследуем вопрос, почему крайняя часть мужского полового органа имеет такое важное значение
      для близости человека к Богу в определенных группах.
    </p>
    <p>
      Переходим в <RouterLink to="/search">
        Поиск
      </RouterLink> и ищем по словам "обрезание", "обрезать" и "обрезывать".
      <!-- </p>
    <p> -->
      Получаем следующие слова:
      H5243, H2168,
      G4059, G4061,
      H4135, H4139,
      G0203
    </p>
    <p>
      К ним добавляются выражение "крайняя плоть": H6190 + H1320
      <!-- <a href="http://localhost:5173/#/verse/23:5:6/H2168">()</a> - совершенно разные. -->
    </p>
    <p>
      Получаем порядка 40 упоминаний. Сразу можно отметить, что нигде нет и намека на то,
      что "крайняя плоть" имеет какое-то отношение к мужскому половому органу.
    </p>
    <p>
      Наоборот, "плоть" чаще переводится как "тело", в противопоставлении духу и душе.
    </p>
    <p>
      Кроме того, из следующих стихов становится довольно ясно, что под этим имеется ввиду:
    </p>

    <ul>
      <li>
        потому что обрезание — мы, служащие Богу духом и хвалящиеся Христом Иисусом, и не на плоть надеющиеся,
        (Фил 3:3)
      </li>
      <li>
        Итак обрежьте крайнюю плоть сердца вашего и не будьте впредь жестоковыйны;
        (Втор 10:16)
      </li>
      <li>
        Обрежьте себя для Господа, и снимите крайнюю плоть с сердца вашего, мужи Иуды и жители Иерусалима,
        чтобы гнев Мой не открылся, как огонь, и не воспылал неугасимо по причине злых наклонностей ваших.
        (Иер 4:4)
      </li>
      <li>
        Ибо не тот Иудей, кто [таков] по наружности, и не то обрезание, которое наружно, на плоти,
        но [тот] Иудей, кто внутренно [таков], и [то] обрезание, [которое] в сердце, по духу,
        [а] не по букве: ему и похвала не от людей, но от Бога.
        (Рим 2:28--29)
      </li>
      <li>
        В Нем вы и обрезаны обрезанием нерукотворенным, совлечением греховного тела плоти, обрезанием Христовым;
        (Кол 2:11)
      </li>
    </ul>
  </div>
</template>

<style scoped>
ul  {
  margin-left: 1em;
  li {
    list-style: disc;
    margin: 0.5em;
    font-style: italic;
  }
}
</style>
