<script setup lang="ts">
import { onMounted } from "vue";
// import { api } from "@/services/api";

// interface IOption {
//   name: string
//   value: string
// }

// const apiData = ref();

onMounted(async () => {
  // apiData.value = await api.utils.testRest();
});
</script>

<template>
  <div>
    <h2>Библеистика</h2>
    <p>
      Библеистика — научная дисциплина, занимающаяся изучением различных аспектов Библии 
      посредством текстологического и литературного анализа, используя рационалистические методы исследования.
    </p>
    <p>
      Данное веб-приложение с помощью 
      <a href="https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D0%BD%D0%BA%D0%BE%D1%80%D0%B4%D0%B0%D0%BD%D1%86%D0%B8%D1%8F_%D0%A1%D1%82%D1%80%D0%BE%D0%BD%D0%B3%D0%B0#:~:text=%D0%A1%D0%B8%D0%BC%D1%84%D0%BE%D0%BD%D0%B8%D1%8F%20%D0%A1%D1%82%D1%80%D0%BE%D0%BD%D0%B3%D0%B0%20%D0%B2%D0%BA%D0%BB%D1%8E%D1%87%D0%B0%D0%B5%D1%82%20%D0%B2%20%D1%81%D0%B5%D0%B1%D1%8F,%D0%B0%D0%BD%D0%B3%D0%BB%D0%B8%D0%B9%D1%81%D0%BA%D0%BE%D0%BC%D1%83%20%D0%BF%D0%B5%D1%80%D0%B5%D0%B2%D0%BE%D0%B4%D1%83%20%D0%91%D0%B8%D0%B1%D0%BB%D0%B8%D0%B8%20%E2%80%94%20%D0%BA%D0%BE%D1%80%D0%BE%D0%BB%D1%8F%20%D0%AF%D0%BA%D0%BE%D0%B2%D0%B0." target="_blank">Конкордации Стронга</a>
      позволяет задействовать некоторые математические методы при изучении Библии.
    </p>
    <h3>Обоснование</h3>
    <p>
      Текст Библии можно рассматривать как информацию из некоторого источника. В процессе превращения ее в 
      современный русскоязычный синодальный перевод она прошла стадии преобразования из невербальной формы в 
      вербальную, в письменную в форме масоретских манускриптов (древнееврейский) и Септуагинты (древнегреческий) 
      и затем в синодальный текст. 
    </p>
    <p>
      Как при любой передаче информации, здесь могли иметь место потеря информации, 
      её случайное искажение и сознательная дезинформация. 
    </p>
    <p>
      Кроме того, по общепризнанному мнению, библейские высказывания могут нести 
      до трех смыслов - буквальный, переносный и духовный/эзотерический.
      При переводе может сохраниться буквальный смысл, но потеряться другие.
    </p>
    <p>
      Не меньший вред приносят всевозможные <i>толкования Библии</i>, вносящие 
      еще один фактор потери/искажения информации и обычно только уводящие от первоисточника.
    </p>
    <p>
      Поэтому самостоятельное изучение Библии - наиболее эффективный способ анализа 
      как для теолога, так и атеиста.
    </p>
    <p>
      Более подробная информация о возможностях данного приложения и вариантах его использования - в 
      <RouterLink to="/help">справке</RouterLink>.
    </p>
    
  </div>
</template>

<style scoped>
a {
  text-decoration: underline;
  color: var(--bbl-c-text-3);
  &:hover {
    color: var(--bbl-c-text-1);
  }
}
</style>
