<script setup lang="ts">
// import { onMounted } from "vue";
import VerseSection from "@/components/verse/VerseSection.vue";
import { addFirstVerse } from "@/utils/verseUtils";

addFirstVerse();
</script>

<template>
  <div>
    <VerseSection vid="1:1:1" />
    <div>
      <h2>Библеистика</h2>
      <p>
        Библеистика — научная дисциплина, занимающаяся изучением различных аспектов Библии
        посредством текстологического и литературного анализа, используя рационалистические методы исследования.
      </p>
      <p>
        Данное веб-приложение с помощью
        <a href="https://ru.wikipedia.org/wiki/Конкорданция_Стронга" target="_blank">Конкордации Стронга</a>
        позволяет задействовать некоторые математические методы при изучении Библии.
      </p>
      <h3>Обоснование</h3>
      <p>
        Текст Библии можно рассматривать как информацию из некоторого источника. В процессе превращения ее в
        современный русскоязычный синодальный перевод она прошла стадии преобразования из невербальной формы в
        вербальную, в письменную в форме масоретских манускриптов (древнееврейский) и Септуагинты (древнегреческий)
        и затем в синодальный текст.
      </p>
      <p>
        Как при любой передаче информации, здесь могли иметь место потеря информации,
        её случайное искажение и сознательная дезинформация.
      </p>
      <p>
        Кроме того, по общепризнанному мнению, библейские высказывания могут нести
        до трех смыслов - буквальный, переносный и духовный/эзотерический.
        При переводе может сохраниться буквальный смысл, но потеряться другие.
      </p>
      <p>
        Не меньший вред приносят всевозможные "толкования" Библии, вносящие
        еще один фактор потери/искажения информации и обычно только уводящие от первоисточника.
      </p>
      <p>
        Поэтому самостоятельное изучение Библии - наиболее эффективный способ анализа
        как для теолога, так и атеиста.
      </p>
      <p>
        Более подробная информация о возможностях данного приложения и вариантах его использования - в
        <RouterLink to="/help">
          справке
        </RouterLink>.
      </p>
    </div>
  </div>
</template>

<style scoped>
</style>
