<?php

$data = [
    [
        1,
        "Бытие"
    ],
    [
        2,
        "Исход"
    ],
    [
        3,
        "Левит"
    ],
    [
        4,
        "Числа"
    ],
    [
        5,
        "Второзаконие"
    ],
    [
        6,
        "Иисус Навин"
    ],
    [
        7,
        "Судьи"
    ],
    [
        8,
        "Руфь"
    ],
    [
        9,
        "1 Царств"
    ],
    [
        10,
        "2 Царств"
    ],
    [
        11,
        "3 Царств"
    ],
    [
        12,
        "4 Царств"
    ],
    [
        13,
        "1 Паралипоменон"
    ],
    [
        14,
        "2 Паралипоменон"
    ],
    [
        15,
        "Ездра"
    ],
    [
        16,
        "Неемия"
    ],
    [
        17,
        "Есфирь"
    ],
    [
        18,
        "Иов"
    ],
    [
        19,
        "Псалтирь"
    ],
    [
        20,
        "Притчи"
    ],
    [
        21,
        "Екклесиаст"
    ],
    [
        22,
        "Песня Песней"
    ],
    [
        23,
        "Исаия"
    ],
    [
        24,
        "Иеремия"
    ],
    [
        25,
        "Плач Иеремии"
    ],
    [
        26,
        "Иезекииль"
    ],
    [
        27,
        "Даниил"
    ],
    [
        28,
        "Осия"
    ],
    [
        29,
        "Иоиль"
    ],
    [
        30,
        "Амос"
    ],
    [
        31,
        "Авдий"
    ],
    [
        32,
        "Иона"
    ],
    [
        33,
        "Михей"
    ],
    [
        34,
        "Наум"
    ],
    [
        35,
        "Аввакум"
    ],
    [
        36,
        "Софония"
    ],
    [
        37,
        "Аггей"
    ],
    [
        38,
        "Захария"
    ],
    [
        39,
        "Малахия"
    ],
    [
        40,
        "От Матфея"
    ],
    [
        41,
        "От Марка"
    ],
    [
        42,
        "От Луки"
    ],
    [
        43,
        "От Иоанна"
    ],
    [
        44,
        "Деяния"
    ],
    [
        45,
        "Иакова"
    ],
    [
        46,
        "1 Петра"
    ],
    [
        47,
        "2 Петра"
    ],
    [
        48,
        "1 Иоанна"
    ],
    [
        49,
        "2 Иоанна"
    ],
    [
        50,
        "3 Иоанна"
    ],
    [
        51,
        "Иуды"
    ],
    [
        52,
        "Римлянам"
    ],
    [
        53,
        "1 Коринфянам"
    ],
    [
        54,
        "2 Коринфянам"
    ],
    [
        55,
        "Галатам"
    ],
    [
        56,
        "Ефесянам"
    ],
    [
        57,
        "Филиппийцам"
    ],
    [
        58,
        "Колоссянам"
    ],
    [
        59,
        "1 Фессалоникийцам"
    ],
    [
        60,
        "2 Фессалоникийцам"
    ],
    [
        61,
        "1 Тимофею"
    ],
    [
        62,
        "2 Тимофею"
    ],
    [
        63,
        "Титу"
    ],
    [
        64,
        "Филимону"
    ],
    [
        65,
        "Евреям"
    ],
    [
        66,
        "Откровение"
    ]
    ];

    $data = array_map(function ($item) {
        return $item[1];
    }, $data);

    $data = json_encode($data, JSON_PRETTY_PRINT | JSON_UNESCAPED_UNICODE);
    echo $data;
    file_put_contents('test.json', $data);

?>